Model: "functional_13"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
demand_in (InputLayer)          [(None, 388)]        0                                            
__________________________________________________________________________________________________
cluster_demand (Dense)          (None, 30)           11670       demand_in[0][0]                  
__________________________________________________________________________________________________
states_in (InputLayer)          [(None, 7)]          0                                            
__________________________________________________________________________________________________
inputs_in (InputLayer)          [(None, 14)]         0                                            
__________________________________________________________________________________________________
input_concatenate (Concatenate) (None, 51)           0           cluster_demand[0][0]             
                                                                 states_in[0][0]                  
                                                                 inputs_in[0][0]                  
__________________________________________________________________________________________________
interm_0 (Dense)                (None, 50)           2600        input_concatenate[0][0]          
__________________________________________________________________________________________________
interm_1 (Dense)                (None, 50)           2550        interm_0[0][0]                   
__________________________________________________________________________________________________
interm_2 (Dense)                (None, 50)           2550        interm_1[0][0]                   
__________________________________________________________________________________________________
interm_3 (Dense)                (None, 50)           2550        interm_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_strided_slice_13 (T [(None, 20)]         0           interm_3[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_strided_slice_12 (T [(None, 30)]         0           interm_3[0][0]                   
__________________________________________________________________________________________________
dstates_out (Dense)             (None, 7)            147         tf_op_layer_strided_slice_13[0][0
__________________________________________________________________________________________________
pressure_out (Dense)            (None, 388)          12028       tf_op_layer_strided_slice_12[0][0
__________________________________________________________________________________________________
energy_out (Dense)              (None, 11)           231         tf_op_layer_strided_slice_13[0][0
__________________________________________________________________________________________________
states_out (Add)                (None, 7)            0           dstates_out[0][0]                
                                                                 states_in[0][0]                  
==================================================================================================
Total params: 34,326
Trainable params: 34,326
Non-trainable params: 0
__________________________________________________________________________________________________
